Revit 2027 API
RebarBendingDetail.GetHosts Method
 Gets a reference to the reinforcement elements that this bending detail represents.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Reference> GetHosts(
	Element bendingDetail
)
Public Shared Function GetHosts (
	bendingDetail As Element
) As IList(Of Reference)
public:
static IList<Reference^>^ GetHosts(
	Element^ bendingDetail
)
static member GetHosts :
        bendingDetail : Element -> IList<Reference>
Parameters
bendingDetail Element
 The bending detail for which we want to get the host.
Return Value
IList<Reference>
 Returns a reference pointing to the reinforcement elements represented by the input bending detail.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace